{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          4
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "<unk>",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "<bos>": 0,
      "<cls>": 1,
      "<pad>": 2,
      "<sep>": 3,
      "<eos>": 4,
      "<unk>": 5,
      "<mask>": 6,
      "[:=2chiral]": 7,
      "[:#0sulfoxime_cis]": 8,
      "[:3boron]": 9,
      "[:#0sulfoxime_trans]": 10,
      "[#I]": 11,
      "[:#0chiral2c13]": 12,
      "[:=1phosphine4]": 13,
      "[:#1sulfan_general]": 14,
      "[:=1ammonium]": 15,
      "[:#1phosphine3]": 16,
      "[:2boron]": 17,
      "[=Ring2]": 18,
      "[/O]": 19,
      "[/I]": 20,
      "[Branch]": 21,
      "[:#0chiralc13]": 22,
      "[:#1ammonium2]": 23,
      "[:1sulfilimine_trans]": 24,
      "[:1sulfan_general]": 25,
      "[/Br]": 26,
      "[:1phosphine7]": 27,
      "[:=1sulfox_general]": 28,
      "[=Ring3]": 29,
      "[:1sulfoxime_cis]": 30,
      "[:2aziridine_n]": 31,
      "[:=1sulfoxime_trans]": 32,
      "[:#1sulfox_general]": 33,
      "[:#1bridged_n]": 34,
      "[F]": 35,
      "[:#2sulfoxime_trans]": 36,
      "[:=0ammonium]": 37,
      "[Ring3]": 38,
      "[pop]": 39,
      "[:#1chiral2]": 40,
      "[:#1phosphine2]": 41,
      "[:=0phosphine7]": 42,
      "[:#0phosphine2]": 43,
      "[:=3chiral2c13]": 44,
      "[:#2phosphine2]": 45,
      "[:#0boron]": 46,
      "[:=1sulfilimine_cis]": 47,
      "[:#2sulfoxime_cis]": 48,
      "[/Ring1]": 49,
      "[:3chiral2c13]": 50,
      "[:=0sulfox_general]": 51,
      "[:=1phosphine7]": 52,
      "[/F]": 53,
      "[#Br]": 54,
      "[:=2ammonium2]": 55,
      "[:=0chiralc13]": 56,
      "[:2sulfox_general]": 57,
      "[#Ring3]": 58,
      "[=C]": 59,
      "[\\Ring2]": 60,
      "[\\P]": 61,
      "[:=0chiral]": 62,
      "[:1chiral2c13]": 63,
      "[:1phosphine2]": 64,
      "[:2chiralc13]": 65,
      "[\\S]": 66,
      "[:=0phosphine4]": 67,
      "[:=1chiralc13]": 68,
      "[:#0phosphine4]": 69,
      "[:2phosphine7]": 70,
      "[:#3phosphine7]": 71,
      "[:=3ammonium]": 72,
      "[:#1sulfilimine_cis]": 73,
      "[:1aziridine_n]": 74,
      "[:2phosphine5]": 75,
      "[:0phosphine5]": 76,
      "[:2sulfoxime_trans]": 77,
      "[:#0phosphine3]": 78,
      "[:0ammonium2]": 79,
      "[:=1aziridine_n]": 80,
      "[:#0phosphine]": 81,
      "[:#1boron]": 82,
      "[:=1phosphine5]": 83,
      "[:2bridged_n]": 84,
      "[:1chiral2]": 85,
      "[/Cl]": 86,
      "[:#1phosphine6]": 87,
      "[:=1ammonium2]": 88,
      "[:#2sulfonium]": 89,
      "[:=2ammonium]": 90,
      "[C]": 91,
      "[/C]": 92,
      "[:=1sulfoxime_cis]": 93,
      "[:3chiral2]": 94,
      "[:#0chiral2]": 95,
      "[:=0phosphine5]": 96,
      "[:=2aziridine_n]": 97,
      "[:=2chiral2c13]": 98,
      "[:#0sulfilimine_trans]": 99,
      "[:#3ammonium]": 100,
      "[:=0ammonium2]": 101,
      "[#F]": 102,
      "[:=2sulfonium]": 103,
      "[:#0aziridine_n]": 104,
      "[:=0sulfoxime_trans]": 105,
      "[=P]": 106,
      "[=B]": 107,
      "[:2chiral2]": 108,
      "[:2sulfilimine_trans]": 109,
      "[:#1sulfilimine_trans]": 110,
      "[:#2ammonium]": 111,
      "[:=2sulfox_general]": 112,
      "[:=0chiral2c13]": 113,
      "[:#1phosphine4]": 114,
      "[:#1phosphine7]": 115,
      "[:=2boron]": 116,
      "[:=1chiral2c13]": 117,
      "[:1phosphine]": 118,
      "[:#0ammonium2]": 119,
      "[:=1bridged_n]": 120,
      "[#C]": 121,
      "[:#2phosphine5]": 122,
      "[#Branch]": 123,
      "[:#0bridged_n]": 124,
      "[:#2sulfox_general]": 125,
      "[:#1chiral]": 126,
      "[:#0phosphine5]": 127,
      "[:2ammonium]": 128,
      "[:=1sulfilimine_trans]": 129,
      "[:=0aziridine_n]": 130,
      "[:=2sulfan_general]": 131,
      "[=S]": 132,
      "[:#1chiralc13]": 133,
      "[:#2sulfilimine_cis]": 134,
      "[:=0sulfan_general]": 135,
      "[:1phosphine3]": 136,
      "[:#0chiral]": 137,
      "[:0sulfonium]": 138,
      "[:2phosphine2]": 139,
      "[:=2phosphine6]": 140,
      "[:#2chiralc13]": 141,
      "[:0sulfilimine_cis]": 142,
      "[:=0phosphine6]": 143,
      "[Ring1]": 144,
      "[O]": 145,
      "[:#2phosphine7]": 146,
      "[\\B]": 147,
      "[:#1aziridine_n]": 148,
      "[:#1phosphine]": 149,
      "[:=0sulfilimine_trans]": 150,
      "[:=2phosphine2]": 151,
      "[Ring2]": 152,
      "[#N]": 153,
      "[#O]": 154,
      "[/B]": 155,
      "[:0ammonium]": 156,
      "[:0phosphine6]": 157,
      "[:3ammonium]": 158,
      "[/P]": 159,
      "[:=1sulfan_general]": 160,
      "[:0sulfilimine_trans]": 161,
      "[\\Ring3]": 162,
      "[:0phosphine]": 163,
      "[:=2chiral2]": 164,
      "[:#0sulfan_general]": 165,
      "[:1boron]": 166,
      "[:=2sulfoxime_trans]": 167,
      "[:#2chiral2]": 168,
      "[:#0phosphine6]": 169,
      "[:#2boron]": 170,
      "[:#2bridged_n]": 171,
      "[:#1sulfoxime_trans]": 172,
      "[:0phosphine2]": 173,
      "[:2sulfonium]": 174,
      "[:2ammonium2]": 175,
      "[:=0sulfoxime_cis]": 176,
      "[\\I]": 177,
      "[:=0chiral2]": 178,
      "[:=0boron]": 179,
      "[\\Br]": 180,
      "[->]": 181,
      "[=F]": 182,
      "[:0boron]": 183,
      "[:#2chiral2c13]": 184,
      "[#Ring1]": 185,
      "[\\Ring1]": 186,
      "[:#1sulfoxime_cis]": 187,
      "[:1phosphine5]": 188,
      "[:=1chiral2]": 189,
      "[:=2sulfoxime_cis]": 190,
      "[:#1ammonium]": 191,
      "[:#3boron]": 192,
      "[:1sulfilimine_cis]": 193,
      "[:=3chiral2]": 194,
      "[:#3chiral2c13]": 195,
      "[:=1sulfonium]": 196,
      "[:=1phosphine]": 197,
      "[\\C]": 198,
      "[#S]": 199,
      "[:=1boron]": 200,
      "[:=2bridged_n]": 201,
      "[:=3boron]": 202,
      "[\\N]": 203,
      "[=Ring1]": 204,
      "[/Ring2]": 205,
      "[:1sulfoxime_trans]": 206,
      "[:2sulfan_general]": 207,
      "[:=1phosphine2]": 208,
      "[:0phosphine7]": 209,
      "[:0sulfan_general]": 210,
      "[:=1chiral]": 211,
      "[:1chiral]": 212,
      "[:0chiral2]": 213,
      "[:0chiral]": 214,
      "[:#1sulfonium]": 215,
      "[:=0phosphine]": 216,
      "[=N]": 217,
      "[:#3chiral2]": 218,
      "[:#1chiral2c13]": 219,
      "[:#0sulfonium]": 220,
      "[:#0sulfilimine_cis]": 221,
      "[:=1phosphine6]": 222,
      "[:1chiralc13]": 223,
      "[:=1phosphine3]": 224,
      "[:2phosphine6]": 225,
      "[=O]": 226,
      "[#P]": 227,
      "[N]": 228,
      "[B]": 229,
      "[:=2sulfilimine_trans]": 230,
      "[:=0phosphine3]": 231,
      "[:1phosphine6]": 232,
      "[#Cl]": 233,
      "[:=0bridged_n]": 234,
      "[:#2ammonium2]": 235,
      "[:2chiral]": 236,
      "[:2sulfoxime_cis]": 237,
      "[:#2chiral]": 238,
      "[P]": 239,
      "[:#2phosphine6]": 240,
      "[\\Cl]": 241,
      "[\\O]": 242,
      "[:0aziridine_n]": 243,
      "[:=0sulfonium]": 244,
      "[S]": 245,
      "[:#1phosphine5]": 246,
      "[:=2sulfilimine_cis]": 247,
      "[:#2sulfilimine_trans]": 248,
      "[:1ammonium]": 249,
      "[=I]": 250,
      "[\\F]": 251,
      "[:0bridged_n]": 252,
      "[:1phosphine4]": 253,
      "[:=2chiralc13]": 254,
      "[:=3phosphine7]": 255,
      "[/S]": 256,
      "[:0sulfoxime_cis]": 257,
      "[Br]": 258,
      "[/Ring3]": 259,
      "[:#0phosphine7]": 260,
      "[:1ammonium2]": 261,
      "[:#2sulfan_general]": 262,
      "[:0phosphine4]": 263,
      "[:=0phosphine2]": 264,
      "[/N]": 265,
      "[:=2phosphine7]": 266,
      "[=Cl]": 267,
      "[:=0sulfilimine_cis]": 268,
      "[=Branch]": 269,
      "[:#2aziridine_n]": 270,
      "[Cl]": 271,
      "[:2chiral2c13]": 272,
      "[:2sulfilimine_cis]": 273,
      "[:#0sulfox_general]": 274,
      "[#Ring2]": 275,
      "[:#0ammonium]": 276,
      "[:0chiral2c13]": 277,
      "[:0chiralc13]": 278,
      "[:1bridged_n]": 279,
      "[:0sulfox_general]": 280,
      "[:0sulfoxime_trans]": 281,
      "[:3phosphine7]": 282,
      "[I]": 283,
      "[=Br]": 284,
      "[:1sulfox_general]": 285,
      "[:=2phosphine5]": 286,
      "[:1sulfonium]": 287,
      "[:0phosphine3]": 288,
      "[#B]": 289
    }
  }
}